src/app/controllers/bookings_controller.rb

  def index
    @bookings = current_user.bookings.all
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 ORDER BY booking_id ASC  [["user_id", 1]]