src/app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def booking_show
    @booking = Booking.find(params[:id])

INSERT INTO "bookings" ("user_id", "vehicle_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["vehicle_id", 1], ["created_at", "2021-11-23 07:24:58.458268"], ["updated_at", "2021-11-23 07:24:58.458268"]]
---
  def create
    @booking = Booking.new
    @booking.user_id = current_user.id
    @booking.vehicle_id = params[:id]
    respond_to do |format|
      if @booking.save

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 1]]
UPDATE "vehicles" SET "available" = $1, "updated_at" = $2 WHERE "vehicles"."id" = $3  [["available", true], ["updated_at", "2021-11-24 06:09:14.768544"], ["id", 1]]
---
  def destroy
    @booking = Booking.find(params[:id])
    respond_to do |format|
      if @booking.destroy
        @booking.vehicle.update(available: true)