src/app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    @booking = Booking.find(params[:id])