src/app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles" ORDER BY brand ASC
---
  def index
    @vehicles = Vehicle.all.order("brand ASC")

DELETE FROM "vehicles" WHERE "vehicles"."id" = $1  [["id", 49]]
---
  def destroy
    @vehicle = Vehicle.find(params[:id])
    @vehicle.destroy