src/app/controllers/vehicles_controller.rb

  def update
      @vehicle = Vehicle.find(params[:id])

      respond_to do |format|
          if @vehicle.update vehicle_params
---
UPDATE "vehicles" SET "updated_at" = $1 WHERE "vehicles"."id" = $2  [["updated_at", "2021-11-17 11:48:20.253107"], ["id", 2]]