src/app/controllers/vehicles_controller.rb

  def vehicles_index
    @vehicles = Vehicle.all.order("brand ASC")
---
SELECT "vehicles".* FROM "vehicles" ORDER BY brand ASC

  def show
    @vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]

  def create
      # First do a check if user-owner relationship exists, if not then create one.
      check_owners_exist

      owner_id = current_user.owner.id
      @vehicle = Vehicle.new vehicle_params
      @vehicle.owner_id = owner_id
    respond_to do |format|
      if @vehicle.save
---
INSERT INTO "owners" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2021-11-23 04:43:12.817612"], ["updated_at", "2021-11-23 04:43:12.817612"]]
INSERT INTO "vehicles" ("brand", "model", "body_type", "door_count", "seat_count", "available", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit
    @vehicle = Vehicle.find(params[:id])
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
      @vehicle = Vehicle.find(params[:id])

      respond_to do |format|
          if @vehicle.update vehicle_params
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "vehicles" SET "body_type" = $1, "updated_at" = $2 WHERE "vehicles"."id" = $3  [["body_type", "Large Car"], ["updated_at", "2021-11-17 11:48:41.741842"], ["id", 2]]

  def destroy
    @vehicle = Vehicle.find(params[:id])
    respond_to do |format|
      if @vehicle.destroy
---
SELECT "vehicles".* FROM "vehicles" WHERE "vehicles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "vehicles" WHERE "vehicles"."id" = $1  [["id", 1]]

  def check_owners_exist
    if ! current_user.owner
      Owner.create(user: current_user)
---
INSERT INTO "owners" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2021-11-23 04:43:12.817612"], ["updated_at", "2021-11-23 04:43:12.817612"]]