src/app/views/bookings/bookings_index.html.erb

<%# Check if any active bookings else show a message. %>
<% if ! current_user.bookings.exists? %>
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 51]]
SELECT 1 AS one FROM "bookings" WHERE "bookings"."user_id" = $1 LIMIT $2  [["user_id", 51], ["LIMIT", 1]]