src/app/views/bookings/index.html.erb

SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 1]]
SELECT 1 AS one FROM "bookings" WHERE "bookings"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---

<% if ! current_user.bookings.exists? %>