src/app/views/vehicles/show.html.erb

  <%# The owner can't delete a vehicle that is currently have an active booking because that will result in an anomaly %>
  <% if Booking.exists?(vehicle_id: @vehicle.id) %>
---
SELECT 1 AS one FROM "bookings" WHERE "bookings"."vehicle_id" = $1 LIMIT $2  [["vehicle_id", 13], ["LIMIT", 1]]